#!/usr/bin/python
# -*- coding:utf-8

#引用对象需添加以下code：
#------------------------appendPath------------------------
#自定义目录使用sys.path.append(sys.path[0]+r'../common')
#上层目录使用sys.path.append('..')
#当前目录下可忽略添加环境地址
#--------------------------import--------------------------
#from common.font import *
#-------防止高频调用导致堵塞，可对某些字段进行存储---------
#Processing=str(Processing())
#Information=str(Information())
#Detected=str(Detected())
#Result=str(Result())
#Error=str(Error())

import os
import sys

try:
    import terminal
except:
    print('检测出您未安装terminal模块，将替您安装此模块，请稍候……')
    os.system('pip install terminal')
    import terminal
try:
    import console
except:
    print('检测出您未安装console模块，将替您安装此模块，请稍候……')
    os.system('pip install console')
    import console

def red(text):
    return terminal.bold(terminal.red(text))

def green(text):
    return terminal.green(text)

def blue(text):
    return terminal.bold(terminal.blue(text))

def magenta(text):
    return terminal.magenta(text)

def yellow(text):
    return terminal.yellow(text)

def cyan(text):
    return terminal.cyan(text)

def bold(text):#高亮
    return terminal.bold(text)

def Processing():
    return terminal.magenta(r"[Processing] ")

def Information():
    return terminal.cyan(r"[Information] ")

def Detected():
    return terminal.bold(terminal.blue(r"[Detected] "))

def Result():
    return terminal.bold(terminal.green(r"[Result] "))

def Error():
    return terminal.bold(terminal.red(r"[Error] "))

def Input():
    return terminal.bold(terminal.yellow(r"<Potato>$ "))

def logo_1():
    os.system("cls")#Linux使用clear
    print ('')
    print ('''\033[1m

############################################################################################
##                           \033[0m'''+'''\033[1;31m    ___       ___       ___       ___       ___       ___    \033[0m'''+'''\033[1m##
##  --ScriptName: potato     \033[0m'''+'''\033[1;31m   /\  \     /\  \     /\  \     /\  \     /\  \     /\  \   \033[0m'''+'''\033[1m##
##  --Author    : LiJunYi    \033[0m'''+'''\033[1;31m  /::\  \   /::\  \    \:\  \   /::\  \    \:\  \   /::\  \  \033[0m'''+'''\033[1m##
##  --QQ        : 2438325121 \033[0m'''+'''\033[1;34m /:\033[0m'''+'''\033[1;31m:\:\__\ \033[0m'''+'''\033[1;34m/:\033[0m'''+'''\033[1;31m/\:\__\   /::\__\ \033[0m'''+'''\033[1;34m/:\033[0m'''+'''\033[1;31m:\:\__\   /::\__\ \033[0m'''+'''\033[1;34m/:\033[0m'''+'''\033[1;31m/\:\__\ \033[0m'''+'''\033[1m##
##  --Type      : Penetration\033[0m'''+'''\033[1;34m \/\\\033[0m'''+'''\033[1;31m::/  / \033[0m'''+'''\033[1;34m\:\\\033[0m'''+'''\033[1;31m/:/  /  \033[0m'''+'''\033[1;34m/:\033[0m'''+'''\033[1;31m/\/__/ \033[0m'''+'''\033[1;34m\/\\\033[0m'''+'''\033[1;31m::/  /  \033[0m'''+'''\033[1;34m/:\033[0m'''+'''\033[1;31m/\/__/ \033[0m'''+'''\033[1;34m\:\\\033[0m'''+'''\033[1;31m/:/  / \033[0m'''+'''\033[1m##
##  --Version   : 0.2.4      \033[0m'''+'''\033[1;34m    \\\033[0m'''+'''\033[1;31m/__/   \033[0m'''+'''\033[1;34m\::\033[0m'''+'''\033[1;31m/  /   \033[0m'''+'''\033[1;34m\/__/      /:\033[0m'''+'''\033[1;31m/  /   \033[0m'''+'''\033[1;34m\/__/     \::\033[0m'''+'''\033[1;31m/  /  \033[0m'''+'''\033[1m##
##                           \033[0m'''+'''\033[1;34m             \/__/               \/__/               \/__/   \033[0m'''+'''\033[1m##
############################################################################################

\033[0m''')
def describe():
    print ('''\033[1m
        +-----------------------------------------------------------------------+
        |                      Potato的常见用法以及相关信息                     |
        +-----------------------------------------------------------------------+
        |                                                                       |
        |   本工具是用于进行全自动化的渗透测试脚本。                            |
        |   通过Fofa的API接口、CMS指纹扫描、NMAP、目录爆破等方式来采集目标信息；|
        |   使用弱密码爆破、sql注入、Nexpose及其他自备脚本进行漏扫；            |
        |   最后通过调用MetaSploit及arp毒化等其他脚本辅助完成后渗透。           |
        |                                                                       |
        +------------------+----------------------------------------------------+
        |   功能选项       |                    功能说明                        |
        +------------------+----------------------------------------------------+
        |1 . 使用帮助      | 展示本页帮助信息。                                 |
        |2 . cms指纹扫描   | 对网站指纹扫描，判断所使用的cms                    |
        |3 . 资产检索      | 3.1普通版[默认] 3.2vip版                           |
        |4 . 端口服务扫描  | 对靶机端口服务信息扫描并打印                       |
        |5 . 路径爆破      | 对备份路径、后台路径、敏感信息路径进行爆破         |
        |6 . 社工字典生成  | 根据目标信息收集进行整理出专属密码字典             |
        |7 . 弱密码爆破    | 常见服务及端口弱密码爆破                           |
        |8 . 漏洞扫描      | 本地漏洞脚本扫描，亦可使用msfconsolo的nexpose      |
        |9 . sql注入       | 9.1sqlmap[默认] 9.2脚本                            |
        |10. msfconsole    | 调用本地MetaSploit                                 |
        |11. 代码审计      | 可用于cms的0day挖掘                                |
        |12. 日志审计      | 分为应用、安全、系统日志的审计                     |
        |13. hash校验      | 对比文件hash，分析文件变化                         |
        |14. arp攻击       | 对arp进行毒化，可用于横向渗透                      |
        |14. dos攻击       | 分为pingDos和synDos,可用于压力测试                 |
        +------------------+----------------------------------------------------+
        |                               免责声明                                |
        +-----------------------------------------------------------------------+
        |*****************程序仅供技术交流使用，请勿非法使用！******************|
        |******************一切非法使用造成的后果于本人无关！*******************|
        +-----------------------------------------------------------------------+
\033[0m''')

def logo_2():
    print(red('''
                     __        __      
        ____  ____ _/ /_____ _/ /_____ 
       / __ \/ __ `/ __/ __ `/ __/ __ \ 
      / /_/ / /_/ / /_/ /_/ / /_/ /_/ / ''')+blue(''' 
     / .___/\____/\__/\__,_/\__/\____/ 
    /_/  
'''))